#include <stdio.h>

int main() {
    int a = 5, b = 0, c = -3;
    
    // 閫昏緫涓庯細涓や釜鏉′欢閮戒负鐪?    printf("(a > 0) && (b > 0): %d\n", (a > 0) && (b > 0));  // 0
    
    // 閫昏緫鎴栵細鍙鏈変竴涓负鐪?    printf("(a > 0) || (b > 0): %d\n", (a > 0) || (b > 0));  // 1
    
    // 閫昏緫闈烇細鍙栧弽
    printf("!(a > 0): %d\n", !(a > 0));                       // 0
    printf("!(b > 0): %d\n", !(b > 0));                       // 1
    
    // 缁勫悎閫昏緫
    printf("(a > 0) && (c < 0): %d\n", (a > 0) && (c < 0));  // 1
    
    return 0;
}
